--- seshat_cli/src/domain.rs
+++ replace <impl std::fmt::Display for DepthError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -19,20 +19,17 @@
 #[derive(Debug, PartialEq, Eq, Clone)]
 pub enum DepthError {
     Negative,
     ExceedsMax,
 }
 
 impl std::fmt::Display for DepthError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Negative => write!(f, "depth cannot be negative"),
-            Self::ExceedsMax => write!(f, "max nesting depth exceeded"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for DepthError {}
 
 /// Depth level for the complex state subcommand.
 #[derive(Debug, PartialEq, Eq, Clone, Copy)]
 pub struct Depth(i32);
