--- seshat_cli/src/domain.rs
+++ replace < with == in Depth::try_new
@@ -39,17 +39,17 @@
 
 impl Depth {
     /// Attempts to create a new `Depth`, validating boundaries.
     ///
     /// # Errors
     /// Returns an error if the depth is negative or exceeds the maximum (254).
     pub const fn try_new(val: i32) -> Result<Self, DepthError> {
         match val {
-            v if v < 0 => Err(DepthError::Negative),
+            v if v == /* ~ changed by cargo-mutants ~ */ 0 => Err(DepthError::Negative),
             v if v > 254 => Err(DepthError::ExceedsMax),
             v => Ok(Self(v)),
         }
     }
 }
 
 #[derive(Debug, PartialEq, Eq, Clone)]
 pub enum Subcommand {
