--- seshat_cli/src/domain.rs
+++ replace match guard v > 254 with false in Depth::try_new
@@ -40,17 +40,17 @@
 impl Depth {
     /// Attempts to create a new `Depth`, validating boundaries.
     ///
     /// # Errors
     /// Returns an error if the depth is negative or exceeds the maximum (254).
     pub const fn try_new(val: i32) -> Result<Self, DepthError> {
         match val {
             v if v < 0 => Err(DepthError::Negative),
-            v if v > 254 => Err(DepthError::ExceedsMax),
+            v if false /* ~ changed by cargo-mutants ~ */ => Err(DepthError::ExceedsMax),
             v => Ok(Self(v)),
         }
     }
 }
 
 #[derive(Debug, PartialEq, Eq, Clone)]
 pub enum Subcommand {
     ValidCommand,
