--- seshat_cli/src/domain.rs
+++ replace parse_depth -> Result<Depth, ParseDepthError> with Ok(Default::default())
@@ -84,13 +84,10 @@
 
 impl std::error::Error for ParseDepthError {}
 
 /// Parses a string into a `Depth`.
 ///
 /// # Errors
 /// Returns an error if the string is not a valid integer, or if it violates `Depth` limits.
 pub fn parse_depth(s: &str) -> Result<Depth, ParseDepthError> {
-    let val: i32 = s
-        .parse()
-        .map_err(|e: ParseIntError| ParseDepthError::ParseInt(e.to_string()))?;
-    Depth::try_new(val).map_err(ParseDepthError::Domain)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
