--- seshat_cli/src/error.rs
+++ replace <impl std::fmt::Display for ShowError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -16,30 +16,17 @@
     /// `serde_json` serialization of the loaded document failed.
     SerializationFailure(String),
     /// Writing the JSON to stdout failed.
     StdoutWriteFailure(String),
 }
 
 impl std::fmt::Display for ShowError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::FileNotFound(path) => {
-                write!(f, "error: show: file not found: {}", path.display())
-            }
-            Self::IoError(msg) => write!(f, "error: show: I/O error: {msg}"),
-            Self::InvalidUtf8 => write!(f, "error: show: invalid utf-8 in input"),
-            Self::EmptyInput => write!(f, "error: show: empty input"),
-            Self::JsonDeserialize(msg) => write!(f, "error: show: JSON parse error: {msg}"),
-            Self::InvalidDocument(msg) => write!(f, "error: show: invalid document: {msg}"),
-            Self::SerializationFailure(msg) => {
-                write!(f, "error: show: serialization failure: {msg}")
-            }
-            Self::StdoutWriteFailure(msg) => write!(f, "error: show: stdout write failure: {msg}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ShowError {}
 
 /// Represents errors that occur during argument parsing.
 #[derive(Debug, PartialEq, Eq)]
 pub enum ParseError {
