--- seshat_cli/src/error.rs
+++ replace <impl std::fmt::Display for ParseError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -44,20 +44,17 @@
 #[derive(Debug, PartialEq, Eq)]
 pub enum ParseError {
     NoArguments,
     Clap(String),
 }
 
 impl std::fmt::Display for ParseError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::NoArguments => write!(f, "error: no arguments provided"),
-            Self::Clap(msg) => write!(f, "{msg}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Represents errors that occur during command execution.
 #[derive(Debug, PartialEq, Eq)]
 pub enum ExecutionError {
     SimulatedFailure,
     Show(ShowError),
