--- seshat_cli/src/error.rs
+++ replace <impl std::fmt::Display for ExecutionError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -60,22 +60,17 @@
 #[derive(Debug, PartialEq, Eq)]
 pub enum ExecutionError {
     SimulatedFailure,
     Show(ShowError),
 }
 
 impl std::fmt::Display for ExecutionError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::SimulatedFailure => {
-                write!(f, "Execution failed: Subcommand 'simulate_failure' aborted")
-            }
-            Self::Show(e) => write!(f, "{e}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Consolidated error type for the CLI.
 #[derive(Debug, PartialEq, Eq)]
 pub enum Error {
     ArgumentParse(ParseError),
     CommandExecution(ExecutionError),
