--- seshat_cli/src/lib.rs
+++ replace parse_args -> Result<Cli, Error> with Ok(Default::default())
@@ -95,30 +95,17 @@
     #[command(name = "complex-state")]
     ComplexState {
         #[arg(long, allow_negative_numbers = true, value_parser = parse_depth)]
         depth: Depth,
     },
 }
 
 pub fn parse_args(args: impl Iterator<Item = std::ffi::OsString>) -> Result<Cli, Error> {
-    let args_vec: Vec<OsString> = args.collect();
-
-    if args_vec.is_empty() || (args_vec.len() == 1 && args_vec[0].is_empty()) {
-        return Err(Error::ArgumentParse(ParseError::NoArguments));
-    }
-
-    if args_vec.len() > 65535 {
-        return Err(Error::ArgumentParse(ParseError::TooManyArguments));
-    }
-
-    ClapCli::try_parse_from(args_vec).map_or_else(
-        |e| map_clap_error(&e),
-        |clap_cli| Ok(Cli::Run(map_subcommand(clap_cli.subcommand))),
-    )
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_clap_error(e: &clap::Error) -> Result<Cli, Error> {
     match e.kind() {
         clap::error::ErrorKind::DisplayHelp => Ok(Cli::Help),
         clap::error::ErrorKind::DisplayVersion => Ok(Cli::Version),
         _ => Err(Error::ArgumentParse(ParseError::Clap(format_clap_error(e)))),
     }
