--- seshat_cli/src/lib.rs
+++ replace > with < in parse_args
@@ -101,17 +101,17 @@
 
 pub fn parse_args(args: impl Iterator<Item = std::ffi::OsString>) -> Result<Cli, Error> {
     let args_vec: Vec<OsString> = args.collect();
 
     if args_vec.is_empty() || (args_vec.len() == 1 && args_vec[0].is_empty()) {
         return Err(Error::ArgumentParse(ParseError::NoArguments));
     }
 
-    if args_vec.len() > 65535 {
+    if args_vec.len() < /* ~ changed by cargo-mutants ~ */ 65535 {
         return Err(Error::ArgumentParse(ParseError::TooManyArguments));
     }
 
     ClapCli::try_parse_from(args_vec).map_or_else(
         |e| map_clap_error(&e),
         |clap_cli| Ok(Cli::Run(map_subcommand(clap_cli.subcommand))),
     )
 }
