--- seshat_cli/src/lib.rs
+++ replace map_clap_error -> Result<Cli, Error> with Ok(Default::default())
@@ -112,21 +112,17 @@
 
     ClapCli::try_parse_from(args_vec).map_or_else(
         |e| map_clap_error(&e),
         |clap_cli| Ok(Cli::Run(map_subcommand(clap_cli.subcommand))),
     )
 }
 
 fn map_clap_error(e: &clap::Error) -> Result<Cli, Error> {
-    match e.kind() {
-        clap::error::ErrorKind::DisplayHelp => Ok(Cli::Help),
-        clap::error::ErrorKind::DisplayVersion => Ok(Cli::Version),
-        _ => Err(Error::ArgumentParse(ParseError::Clap(format_clap_error(e)))),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn format_clap_error(e: &clap::Error) -> String {
     e.to_string()
         .replace("[COMMAND]", "[OPTIONS] [COMMAND]")
         .replace("'--help'.\n", "'--help'\n")
 }
 
