--- seshat_cli/src/lib.rs
+++ replace execute -> Result<(), Error> with Ok(())
@@ -135,22 +135,17 @@
         ClapSubcommandEnum::ValidCommand => Subcommand::ValidCommand,
         ClapSubcommandEnum::SimulateFailure => Subcommand::SimulateFailure,
         ClapSubcommandEnum::ComplexState { depth } => Subcommand::ComplexState { depth },
     })
 }
 
 #[allow(clippy::needless_pass_by_value)]
 pub fn execute(cli: Cli) -> Result<(), Error> {
-    match cli {
-        Cli::Run(Some(Subcommand::SimulateFailure)) => {
-            Err(Error::CommandExecution(ExecutionError::SimulatedFailure))
-        }
-        Cli::Run(_) | Cli::Help | Cli::Version => Ok(()),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[must_use]
 pub fn get_help() -> String {
     use clap::CommandFactory;
     ClapCli::command().render_help().to_string()
 }
 
