--- seshat_cli/src/lib.rs
+++ replace get_version -> String with String::new()
@@ -151,18 +151,17 @@
 #[must_use]
 pub fn get_help() -> String {
     use clap::CommandFactory;
     ClapCli::command().render_help().to_string()
 }
 
 #[must_use]
 pub fn get_version() -> String {
-    use clap::CommandFactory;
-    ClapCli::command().render_version()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn error_display_returns_formatted_string_when_argument_parse_variant() {
