--- seshat_cli/src/lib.rs
+++ replace <impl std::fmt::Display for ParseError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -8,23 +8,17 @@
 pub enum ParseError {
     NoArguments,
     TooManyArguments,
     Clap(String),
 }
 
 impl std::fmt::Display for ParseError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::NoArguments => write!(f, "error: no arguments provided"),
-            Self::TooManyArguments => {
-                write!(f, "error: argument count exceeds maximum limit of 65535")
-            }
-            Self::Clap(msg) => write!(f, "{msg}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, PartialEq, Eq)]
 pub enum ExecutionError {
     SimulatedFailure,
 }
 
