--- seshat_cli/src/lib.rs
+++ replace <impl std::fmt::Display for ExecutionError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -25,21 +25,17 @@
 
 #[derive(Debug, PartialEq, Eq)]
 pub enum ExecutionError {
     SimulatedFailure,
 }
 
 impl std::fmt::Display for ExecutionError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::SimulatedFailure => {
-                write!(f, "Execution failed: Subcommand 'simulate_failure' aborted")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, PartialEq, Eq)]
 pub enum Error {
     ArgumentParse(ParseError),
     CommandExecution(ExecutionError),
 }
