--- seshat_cli/src/lib.rs
+++ replace <impl std::fmt::Display for Error>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -41,20 +41,17 @@
 #[derive(Debug, PartialEq, Eq)]
 pub enum Error {
     ArgumentParse(ParseError),
     CommandExecution(ExecutionError),
 }
 
 impl std::fmt::Display for Error {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::ArgumentParse(e) => write!(f, "{e}"),
-            Self::CommandExecution(e) => write!(f, "{e}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, PartialEq, Eq, Clone, Copy)]
 pub struct Depth(pub i32);
 
 pub fn parse_depth(s: &str) -> Result<Depth, String> {
     let val: i32 = s.parse().map_err(|_| "number too small".to_string())?;
