--- seshat_cli/src/parser.rs
+++ replace parse_args -> Result<Cli, Error> with Ok(Default::default())
@@ -32,30 +32,17 @@
     },
 }
 
 /// Parses an iterator of string arguments into a `Cli` command.
 ///
 /// # Errors
 /// Returns an `Error` if arguments are invalid or missing.
 pub fn parse_args(args: impl Iterator<Item = std::ffi::OsString>) -> Result<Cli, Error> {
-    let args_vec: Vec<OsString> = args.collect();
-
-    if args_vec.is_empty() || (args_vec.len() == 1 && args_vec[0].is_empty()) {
-        return Err(Error::ArgumentParse(ParseError::NoArguments));
-    }
-
-    ClapCli::try_parse_from(args_vec).map_or_else(
-        |e| map_clap_error(&e),
-        |clap_cli| {
-            Ok(clap_cli
-                .subcommand
-                .map_or(Cli::Bare, |cmd| Cli::Run(map_subcommand(cmd))))
-        },
-    )
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_clap_error(e: &clap::Error) -> Result<Cli, Error> {
     match e.kind() {
         clap::error::ErrorKind::DisplayHelp => Ok(Cli::Help),
         clap::error::ErrorKind::DisplayVersion => Ok(Cli::Version),
         _ => Err(Error::ArgumentParse(ParseError::Clap(e.to_string()))),
     }
