--- seshat_cli/src/parser.rs
+++ delete match arm clap::error::ErrorKind::DisplayVersion in map_clap_error
@@ -51,17 +51,17 @@
                 .map_or(Cli::Bare, |cmd| Cli::Run(map_subcommand(cmd))))
         },
     )
 }
 
 fn map_clap_error(e: &clap::Error) -> Result<Cli, Error> {
     match e.kind() {
         clap::error::ErrorKind::DisplayHelp => Ok(Cli::Help),
-        clap::error::ErrorKind::DisplayVersion => Ok(Cli::Version),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(Error::ArgumentParse(ParseError::Clap(e.to_string()))),
     }
 }
 
 fn map_subcommand(cmd: ClapSubcommandEnum) -> Subcommand {
     match cmd {
         ClapSubcommandEnum::ValidCommand => Subcommand::ValidCommand,
         ClapSubcommandEnum::SimulateFailure => Subcommand::SimulateFailure,
