--- seshat_cli/src/parser.rs
+++ replace map_subcommand -> Subcommand with Default::default()
@@ -57,24 +57,17 @@
     match e.kind() {
         clap::error::ErrorKind::DisplayHelp => Ok(Cli::Help),
         clap::error::ErrorKind::DisplayVersion => Ok(Cli::Version),
         _ => Err(Error::ArgumentParse(ParseError::Clap(e.to_string()))),
     }
 }
 
 fn map_subcommand(cmd: ClapSubcommandEnum) -> Subcommand {
-    match cmd {
-        ClapSubcommandEnum::ValidCommand => Subcommand::ValidCommand,
-        ClapSubcommandEnum::SimulateFailure => Subcommand::SimulateFailure,
-        ClapSubcommandEnum::ComplexState { depth } => Subcommand::ComplexState { depth },
-        ClapSubcommandEnum::Show { file, json: _ } => {
-            Subcommand::Show(crate::show::map_show_subcommand(file))
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[must_use]
 pub fn get_help() -> String {
     use clap::CommandFactory;
     ClapCli::command().render_help().to_string()
 }
 
