--- seshat_cli/src/show.rs
+++ replace execute_show -> Result<(), ShowError> with Ok(())
@@ -136,19 +136,17 @@
 /// # Errors
 /// - Any `ShowError` variant may be returned.
 pub fn execute_show<W: std::io::Write>(
     cmd: &ShowCommand,
     stdin_reader: impl std::io::Read,
     mut writer: W,
     serialize_fn: impl Fn(&DiagramDocument) -> Result<String, ShowError>,
 ) -> Result<(), ShowError> {
-    let doc = load_document(cmd, stdin_reader)?;
-    let json = serialize_fn(&doc)?;
-    write_output(&mut writer, &json)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Dispatches loading to the correct source (file vs. stdin).
 fn load_document(
     cmd: &ShowCommand,
     stdin_reader: impl std::io::Read,
 ) -> Result<DiagramDocument, ShowError> {
     match &cmd.source {
