--- seshat_cli/src/show.rs
+++ replace load_document -> Result<DiagramDocument, ShowError> with Ok(Default::default())
@@ -146,20 +146,17 @@
     write_output(&mut writer, &json)
 }
 
 /// Dispatches loading to the correct source (file vs. stdin).
 fn load_document(
     cmd: &ShowCommand,
     stdin_reader: impl std::io::Read,
 ) -> Result<DiagramDocument, ShowError> {
-    match &cmd.source {
-        ShowSource::File(path) => load_document_from_path(path),
-        ShowSource::Stdin => load_document_from_reader(stdin_reader),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the JSON string followed by a single newline to `writer`, then flushes.
 ///
 /// # Errors
 /// - `ShowError::StdoutWriteFailure` if `write_all` or `flush` fails.
 fn write_output<W: std::io::Write>(writer: &mut W, json: &str) -> Result<(), ShowError> {
     let mut output = Vec::with_capacity(json.len() + 1);
