--- seshat_cli/src/show.rs
+++ replace write_output -> Result<(), ShowError> with Ok(())
@@ -157,25 +157,17 @@
     }
 }
 
 /// Writes the JSON string followed by a single newline to `writer`, then flushes.
 ///
 /// # Errors
 /// - `ShowError::StdoutWriteFailure` if `write_all` or `flush` fails.
 fn write_output<W: std::io::Write>(writer: &mut W, json: &str) -> Result<(), ShowError> {
-    let mut output = Vec::with_capacity(json.len() + 1);
-    output.extend_from_slice(json.as_bytes());
-    output.push(b'\n');
-    writer
-        .write_all(&output)
-        .map_err(|e| ShowError::StdoutWriteFailure(e.to_string()))?;
-    writer
-        .flush()
-        .map_err(|e| ShowError::StdoutWriteFailure(e.to_string()))
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Unit Tests (Calc layer — pure functions)
 // ---------------------------------------------------------------------------
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
