--- seshat_cli/src/show.rs
+++ replace map_show_subcommand -> ShowCommand with Default::default()
@@ -13,19 +13,17 @@
 
 /// Maps the clap-parsed Show args into the domain `ShowCommand` type.
 /// Pure mapping function — no I/O.
 ///
 /// # Postconditions
 /// - Returns `ShowCommand { source: ShowSource::File(path) }` when `file` is `Some`.
 /// - Returns `ShowCommand { source: ShowSource::Stdin }` when `file` is `None`.
 pub(crate) fn map_show_subcommand(file: Option<std::path::PathBuf>) -> ShowCommand {
-    ShowCommand {
-        source: file.map_or(ShowSource::Stdin, ShowSource::File),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Serializes a `DiagramDocument` to a compact JSON string.
 ///
 /// # Errors
 /// - `ShowError::SerializationFailure` — `serde_json` internal error (unreachable in practice).
 pub fn serialize_document(doc: &DiagramDocument) -> Result<String, ShowError> {
     serde_json::to_string(doc).map_err(|e| ShowError::SerializationFailure(e.to_string()))
