--- seshat_cli/src/show.rs
+++ replace load_document_from_path -> Result<DiagramDocument, ShowError> with Ok(Default::default())
@@ -36,19 +36,17 @@
 /// # Errors
 /// - `ShowError::FileNotFound`    — path does not exist or permissions denied.
 /// - `ShowError::IoError`         — other I/O failure during read.
 /// - `ShowError::InvalidUtf8`     — bytes are not valid UTF-8.
 /// - `ShowError::EmptyInput`      — file is zero bytes (or whitespace only).
 /// - `ShowError::JsonDeserialize` — content is not valid JSON.
 /// - `ShowError::InvalidDocument` — JSON is valid but does not match `DiagramDocument` schema.
 pub fn load_document_from_path(path: &std::path::Path) -> Result<DiagramDocument, ShowError> {
-    std::fs::File::open(path)
-        .map_err(|e| map_open_error(&e, path))
-        .and_then(load_document_from_reader)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps a `std::io::Error` from `File::open` into the correct `ShowError` variant.
 ///
 /// `NotFound` and `PermissionDenied` map to `FileNotFound`.
 /// All other I/O errors map to `IoError`.
 fn map_open_error(e: &std::io::Error, path: &std::path::Path) -> ShowError {
     match e.kind() {
