--- seshat_cli/src/show.rs
+++ replace map_open_error -> ShowError with Default::default()
@@ -46,22 +46,17 @@
         .and_then(load_document_from_reader)
 }
 
 /// Maps a `std::io::Error` from `File::open` into the correct `ShowError` variant.
 ///
 /// `NotFound` and `PermissionDenied` map to `FileNotFound`.
 /// All other I/O errors map to `IoError`.
 fn map_open_error(e: &std::io::Error, path: &std::path::Path) -> ShowError {
-    match e.kind() {
-        std::io::ErrorKind::NotFound | std::io::ErrorKind::PermissionDenied => {
-            ShowError::FileNotFound(path.to_path_buf())
-        }
-        _ => ShowError::IoError(e.to_string()),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads bytes from any `Read` implementor and deserializes a `DiagramDocument`.
 ///
 /// # Errors
 /// - `ShowError::IoError`         — I/O failure while reading.
 /// - `ShowError::InvalidUtf8`     — bytes are not valid UTF-8.
 /// - `ShowError::EmptyInput`      — reader yields zero bytes (or whitespace only).
