--- seshat_cli/src/show.rs
+++ replace load_document_from_reader -> Result<DiagramDocument, ShowError> with Ok(Default::default())
@@ -65,23 +65,17 @@
 /// - `ShowError::IoError`         — I/O failure while reading.
 /// - `ShowError::InvalidUtf8`     — bytes are not valid UTF-8.
 /// - `ShowError::EmptyInput`      — reader yields zero bytes (or whitespace only).
 /// - `ShowError::JsonDeserialize` — content is not valid JSON.
 /// - `ShowError::InvalidDocument` — JSON valid but document schema mismatch.
 pub fn load_document_from_reader<R: std::io::Read>(
     mut reader: R,
 ) -> Result<DiagramDocument, ShowError> {
-    let bytes = read_bytes_from_reader(&mut reader)?;
-    let text = decode_utf8(bytes)?;
-    let trimmed = text.trim();
-    if trimmed.is_empty() {
-        return Err(ShowError::EmptyInput);
-    }
-    parse_document(trimmed)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reads all bytes from a reader into a `Vec<u8>`.
 ///
 /// # Errors
 /// - `ShowError::IoError` if reading fails.
 fn read_bytes_from_reader<R: std::io::Read>(reader: &mut R) -> Result<Vec<u8>, ShowError> {
     let mut bytes = Vec::new();
