--- seshat_cli/src/show.rs
+++ replace verification::verify_serialize_document_never_panics_for_valid_doc with ()
@@ -781,24 +781,17 @@
             assert!(matches!(cmd.source, ShowSource::File(_)));
         } else {
             assert!(matches!(cmd.source, ShowSource::Stdin));
         }
     }
 
     #[kani::proof]
     fn verify_serialize_document_never_panics_for_valid_doc() {
-        let doc = DiagramDocument {
-            version: kani::any(),
-            ..DiagramDocument::default()
-        };
-        let result = serialize_document(&doc);
-        if let Ok(s) = result {
-            assert!(!s.is_empty());
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[kani::proof]
     fn verify_show_error_display_prefix_for_all_variants() {
         use crate::error::ShowError;
         let err = ShowError::EmptyInput;
         let s = err.to_string();
         assert!(s.starts_with("error: show: "));
