--- seshat_cli/src/show.rs
+++ delete field version from struct DiagramDocument expression in verification::verify_serialize_document_never_panics_for_valid_doc
@@ -782,17 +782,17 @@
         } else {
             assert!(matches!(cmd.source, ShowSource::Stdin));
         }
     }
 
     #[kani::proof]
     fn verify_serialize_document_never_panics_for_valid_doc() {
         let doc = DiagramDocument {
-            version: kani::any(),
+             /* ~ changed by cargo-mutants ~ */
             ..DiagramDocument::default()
         };
         let result = serialize_document(&doc);
         if let Ok(s) = result {
             assert!(!s.is_empty());
         }
     }
 
