--- seshat_cli/src/show.rs
+++ replace verification::verify_show_error_display_prefix_for_all_variants with ()
@@ -793,24 +793,17 @@
         let result = serialize_document(&doc);
         if let Ok(s) = result {
             assert!(!s.is_empty());
         }
     }
 
     #[kani::proof]
     fn verify_show_error_display_prefix_for_all_variants() {
-        use crate::error::ShowError;
-        let err = ShowError::EmptyInput;
-        let s = err.to_string();
-        assert!(s.starts_with("error: show: "));
-
-        let err2 = ShowError::InvalidUtf8;
-        let s2 = err2.to_string();
-        assert!(s2.starts_with("error: show: "));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[kani::proof]
     fn verify_load_document_from_reader_cannot_return_file_not_found() {
         use std::io::Cursor;
         // load_document_from_reader with an empty reader must not return FileNotFound
         let reader = Cursor::new(vec![]);
         let result = load_document_from_reader(reader);
