--- seshat_cli/src/show.rs
+++ replace verification::verify_load_document_from_reader_cannot_return_file_not_found with ()
@@ -805,21 +805,11 @@
 
         let err2 = ShowError::InvalidUtf8;
         let s2 = err2.to_string();
         assert!(s2.starts_with("error: show: "));
     }
 
     #[kani::proof]
     fn verify_load_document_from_reader_cannot_return_file_not_found() {
-        use std::io::Cursor;
-        // load_document_from_reader with an empty reader must not return FileNotFound
-        let reader = Cursor::new(vec![]);
-        let result = load_document_from_reader(reader);
-        match result {
-            Err(crate::error::ShowError::FileNotFound(_)) => {
-                // This must never happen
-                assert!(false, "FileNotFound is impossible for reader-based load");
-            }
-            _ => {} // Any other outcome is acceptable
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
