--- seshat_cli/src/show.rs
+++ delete match arm Err(crate::error::ShowError::FileNotFound(_)) in verification::verify_load_document_from_reader_cannot_return_file_not_found
@@ -810,16 +810,13 @@
 
     #[kani::proof]
     fn verify_load_document_from_reader_cannot_return_file_not_found() {
         use std::io::Cursor;
         // load_document_from_reader with an empty reader must not return FileNotFound
         let reader = Cursor::new(vec![]);
         let result = load_document_from_reader(reader);
         match result {
-            Err(crate::error::ShowError::FileNotFound(_)) => {
-                // This must never happen
-                assert!(false, "FileNotFound is impossible for reader-based load");
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {} // Any other outcome is acceptable
         }
     }
 }
