--- seshat_cli/src/show.rs
+++ replace read_bytes_from_reader -> Result<Vec<u8>, ShowError> with Ok(vec![0])
@@ -79,21 +79,17 @@
     parse_document(trimmed)
 }
 
 /// Reads all bytes from a reader into a `Vec<u8>`.
 ///
 /// # Errors
 /// - `ShowError::IoError` if reading fails.
 fn read_bytes_from_reader<R: std::io::Read>(reader: &mut R) -> Result<Vec<u8>, ShowError> {
-    let mut bytes = Vec::new();
-    reader
-        .read_to_end(&mut bytes)
-        .map_err(|e| ShowError::IoError(e.to_string()))?;
-    Ok(bytes)
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Converts raw bytes to a UTF-8 `String`.
 ///
 /// # Errors
 /// - `ShowError::InvalidUtf8` if the bytes are not valid UTF-8.
 fn decode_utf8(bytes: Vec<u8>) -> Result<String, ShowError> {
     String::from_utf8(bytes).map_err(|_| ShowError::InvalidUtf8)
