--- seshat_cli/src/show.rs
+++ replace decode_utf8 -> Result<String, ShowError> with Ok("xyzzy".into())
@@ -91,17 +91,17 @@
     Ok(bytes)
 }
 
 /// Converts raw bytes to a UTF-8 `String`.
 ///
 /// # Errors
 /// - `ShowError::InvalidUtf8` if the bytes are not valid UTF-8.
 fn decode_utf8(bytes: Vec<u8>) -> Result<String, ShowError> {
-    String::from_utf8(bytes).map_err(|_| ShowError::InvalidUtf8)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parses a trimmed JSON string into a `DiagramDocument`.
 ///
 /// Uses a two-pass strategy:
 /// 1. Parse as raw `serde_json::Value` to detect syntax/EOF errors → `JsonDeserialize`.
 /// 2. Parse as `DiagramDocument`; data errors (unknown fields, schema mismatches)
 ///    containing "unknown field" → `InvalidDocument`; all others → `JsonDeserialize`.
