--- diagram_models/src/apply.rs
+++ replace apply_delete_node_inner -> Result<DeleteNodeResult, ApplyError> with Ok(Default::default())
@@ -116,49 +116,17 @@
 /// 2. Existence check — verify `node_id` in `doc.document.nodes` (P2)
 /// 3. Collect cascade targets — scan edges referencing `node_id`
 /// 4. Mutate — call `remove_fn`, increment revision
 fn apply_delete_node_inner(
     doc: &mut DiagramDocument,
     change: &ProposedChange,
     remove_fn: impl FnOnce(&mut DiagramDocument, &NodeId) -> Result<(), DocumentError>,
 ) -> Result<DeleteNodeResult, ApplyError> {
-    let (node_id, was_node_id) = match change {
-        ProposedChange::DeleteNode {
-            node_id,
-            was_node_id,
-            ..
-        } => (node_id, was_node_id),
-    };
-
-    // Step 1: Parametric validation — snapshot ID consistency (P1)
-    if was_node_id != node_id {
-        return Err(ApplyError::SnapshotIdMismatch {
-            declared: node_id.clone(),
-            snapshot: was_node_id.clone(),
-        });
-    }
-
-    // Step 2: Existence check (P2)
-    if !doc.document.nodes.contains_key(node_id) {
-        return Err(ApplyError::NodeNotFound(node_id.clone()));
-    }
-
-    // Step 3: Collect cascade targets (pure read)
-    let cascade_deleted_edge_ids = collect_cascade_edge_ids(&doc.document.edges, node_id);
-
-    // Step 4: Mutate — single mutation point
-    remove_fn(doc, node_id).map_err(ApplyError::DocumentError)?;
-
-    doc.revision = doc.revision.increment();
-
-    Ok(DeleteNodeResult {
-        deleted_node_id: node_id.clone(),
-        cascade_deleted_edge_ids,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Collect all edge IDs where `source == node_id` or `target == node_id`.
 ///
 /// Pure read-only scan. Includes self-loops (I5). Returns empty vec if no
 /// edges reference the node (I6).
 fn collect_cascade_edge_ids(edges: &im::HashMap<EdgeId, Edge>, node_id: &NodeId) -> Vec<EdgeId> {
     edges
