--- diagram_models/src/apply.rs
+++ replace != with == in apply_delete_node_inner
@@ -125,17 +125,17 @@
         ProposedChange::DeleteNode {
             node_id,
             was_node_id,
             ..
         } => (node_id, was_node_id),
     };
 
     // Step 1: Parametric validation — snapshot ID consistency (P1)
-    if was_node_id != node_id {
+    if was_node_id == /* ~ changed by cargo-mutants ~ */ node_id {
         return Err(ApplyError::SnapshotIdMismatch {
             declared: node_id.clone(),
             snapshot: was_node_id.clone(),
         });
     }
 
     // Step 2: Existence check (P2)
     if !doc.document.nodes.contains_key(node_id) {
