--- diagram_models/src/apply.rs
+++ delete ! in apply_delete_node_inner
@@ -133,17 +133,17 @@
     if was_node_id != node_id {
         return Err(ApplyError::SnapshotIdMismatch {
             declared: node_id.clone(),
             snapshot: was_node_id.clone(),
         });
     }
 
     // Step 2: Existence check (P2)
-    if !doc.document.nodes.contains_key(node_id) {
+    if  /* ~ changed by cargo-mutants ~ */doc.document.nodes.contains_key(node_id) {
         return Err(ApplyError::NodeNotFound(node_id.clone()));
     }
 
     // Step 3: Collect cascade targets (pure read)
     let cascade_deleted_edge_ids = collect_cascade_edge_ids(&doc.document.edges, node_id);
 
     // Step 4: Mutate — single mutation point
     remove_fn(doc, node_id).map_err(ApplyError::DocumentError)?;
