--- diagram_models/src/apply.rs
+++ replace collect_cascade_edge_ids -> Vec<EdgeId> with vec![]
@@ -156,21 +156,17 @@
     })
 }
 
 /// Collect all edge IDs where `source == node_id` or `target == node_id`.
 ///
 /// Pure read-only scan. Includes self-loops (I5). Returns empty vec if no
 /// edges reference the node (I6).
 fn collect_cascade_edge_ids(edges: &im::HashMap<EdgeId, Edge>, node_id: &NodeId) -> Vec<EdgeId> {
-    edges
-        .iter()
-        .filter(|(_, edge)| edge.source == *node_id || edge.target == *node_id)
-        .map(|(id, _)| id.clone())
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Collect all edge IDs that would be cascade-deleted if the given node were removed.
 ///
 /// Pure read-only query. Does NOT modify the document. Used by the ghost diff
 /// rendering layer to show which edges will disappear.
 ///
 /// # Returns
