--- diagram_models/src/apply.rs
+++ replace == with != in collect_cascade_edge_ids
@@ -158,17 +158,17 @@
 
 /// Collect all edge IDs where `source == node_id` or `target == node_id`.
 ///
 /// Pure read-only scan. Includes self-loops (I5). Returns empty vec if no
 /// edges reference the node (I6).
 fn collect_cascade_edge_ids(edges: &im::HashMap<EdgeId, Edge>, node_id: &NodeId) -> Vec<EdgeId> {
     edges
         .iter()
-        .filter(|(_, edge)| edge.source == *node_id || edge.target == *node_id)
+        .filter(|(_, edge)| edge.source != /* ~ changed by cargo-mutants ~ */ *node_id || edge.target == *node_id)
         .map(|(id, _)| id.clone())
         .collect()
 }
 
 /// Collect all edge IDs that would be cascade-deleted if the given node were removed.
 ///
 /// Pure read-only query. Does NOT modify the document. Used by the ghost diff
 /// rendering layer to show which edges will disappear.
