--- diagram_models/src/apply.rs
+++ replace == with != in check_revision_mismatch
@@ -62,17 +62,17 @@
 ///
 /// # Invariants
 ///
 /// * No mutation of `doc` or `proposal`.
 /// * Never panics.
 /// * O(1) time complexity.
 #[must_use]
 pub fn check_revision_mismatch(doc: &DiagramDocument, proposal: &ProposedChanges) -> ApplyResult {
-    if proposal.base_revision == doc.revision {
+    if proposal.base_revision != /* ~ changed by cargo-mutants ~ */ doc.revision {
         ApplyResult::Applied
     } else {
         ApplyResult::Stale(StaleInfo {
             expected: proposal.base_revision,
             current: doc.revision,
         })
     }
 }
